{ "albums": [{
    "artist": "Led Zeppelin",
    "album": "I",
    "genre": "Rock",
    "review": "As time moves on and 'The 60s' and 'The 70s' become not so much historical periods as media creations, it's harder to take for granted what the significant cultural touchstones of those eras actually mean to current-day society. Some of the artists that were once universally appreciated are slipping from memory, while others are having difficulty translating to new generations. The furor greeting each new Beatles enterprise shows their music and image are indeed proving timeless, and they remain relevant for teenagers and septuagenarians alike—but other giants from the late 1960s and early 70s aren’t having it so easy. The Who’s stock has plummeted in the last decade, and it’s getting tougher to find anyone under 35 who cares about a note of their music made after 1971. The Rolling Stones have been at it so long that it’s difficult for younger people to believe that they were once actually good. Pink Floyd still reach some alienated kids, but their most devoted fans are among the graybeard audiophile set. And then there's Led Zeppelin. \n \n Zeppelin occupies a unique place among this group of bands, in part because their position was hard to pin down while they were active. They were unimaginably popular from 1969 to 1980, but critical respect was elusive. Their suspect reputation has been somewhat overstated (in the U.S., Rolling Stone panned them early on but eventually came around, while Creem and Circus took them seriously all along) but Led Zeppelin never quite registered with the intelligentsia. They made the heaviest hard rock records ever recorded, but their lyrics tended toward loopy mysticism when they weren’t either stealing ideas outright or wallowing in a kind of hedonism where misogyny was a given. \n \n In 2014, Led Zeppelin is typically viewed through one of three lenses: those among the 50-plus set who were actually there hear their music with a nostalgic ear, remembering the days of their youth. There are those who grew up with the assumption that Led Zeppelin were important—let's say 30 to 50 years old—hear them filtered through a second wave of nostalgia, from movie titles like Dazed and Confused and the memory of classic rock radio. To these people (including me), Zeppelin defined an otherworldly image of '70s rock deities, conquering the world on the strength of volume, arena shows, and the baddest riffs the world had ever heard. And then there’s the younger set for whom Zep might seem a little comical, a faintly embarrassing relic from another era even as a certain amount of the music remains undeniable. In one sense, this latter group have more in common with the skeptical critics of the first wave, possessing expectations of 'what music should be' that don’t necessarily apply for a band that sounds like this. \n \n These reissues of Zeppelin’s first three albums are an attempt to reach all of these people, using every tool at the band and label’s disposal. The primary reason these sets are being presented and received as a Big Deal is that they are the first reissues of the digital era (and here I’m using the term to include CDs, which means we’re going back more than 30 years) to include bonus material. The reissues are remastered and are packaged with bonus discs that include previously unreleased live material and studio cuts. The PR push surrounding a big reissue in 2014 inevitably involves sharing things that can spread on social media and hence reach younger kids, while other elements—unheard versions, improved sound—ostensibly entice older fans to re-buy the records. \n \n Jimmy Page, always Led Zeppelin’s sonic architect, heard the blues differently. He heard it as sound first, rather than a form or tradition or product of personalities—maybe that’s why he felt so cavalier about 'borrowing' from blues records without attribution, since you can't copyright a sound—and he understood the trance-inducing element of blues repetition better than anyone: blues as a consciousness-expanding ritual. All of this is clear from the very beginning, as Led Zeppelin is one of music's most assured and fully realized debuts; individually, Jimmy Page, John Paul Jones, and John Bonham were great players, but the whole of their sound somehow exceeded the sum of its parts. But even above the instrumental virtuosity, Led Zeppelin is a triumph of production, each part clear and forceful but adding up to something even more powerful. \n \n Just about everything Zep would do at one point is presented here somewhere—trance-rock ('Dazed and Confused'), gorgeous acoustic folk ('Black Mountain Side'), catchy guitar pop ('Good Times Bad Times'), updates on straight blues ('I Can’t Quit You Baby'). They’d do most of these things better later, but this is where they appeared first. Zep sounded so brilliant right out of the gate because Page was already a veteran of the music scene when they started; working as a session guitarist and later with the Yardbirds, he took in the scene and saw what was missing. As much as Zeppelin understood music, at this point words were more or less just sounds. \n \n Led Zeppelin also set the tone for a decade of dippy lyrics. If Zep was never accepted as hip in some circles, it’s partly because of the knuckle-dragging worldview of songs like 'Dazed and Confused'. It’s hard not to laugh or cringe in 2014 when hearing a line like 'Every day I work so hard, bringin' home my hard-earned pay/ Try and love you baby but you push me away,' but it’s equally difficult not to acknowledge that Robert Plant delivers them with a certain histrionic power. And then a bar later, John Bonham’s slow fills and Page’s terrifying guitar screech come in, and the true meaning of the music is found. \n \n It’s truly impossible to oversell how brilliantly these records are produced; 'rock' as an idea is really a ’70s idea, and Led Zeppelin established what that would mean and what it would sound like, which was as much a matter of arrangement as it was knowing where to set the microphones, how high to mix the bass. You can hear that on the bonus disc to the first album, which was recorded live in Paris in 1969 and aired on radio. The recording fidelity, for a release by such a major band, is remarkably poor—which goes to show how well the vaults have already been cleared out—but there’s no doubting just how much this band could rip in their first year. Of particular note is the attack of Plant’s singing, as he comes over like the unhinged 22-year-old he was. The earliest live recordings by bands are so exciting in large part because the vocalist hasn’t yet learned how to pace himself; Plant sings these songs like Zeppelin might last a year and this is his one chance to get it right. By the late ’70s, purely as a matter of survival, he’d learn how to coast on stage. \n \n There is no arguing with a riff. It’s a conversation-ender, something resistant to analysis that strips away the intellectual to situate the music in a purely physical space. Of the 100 greatest guitar riffs in the history of rock music, Jimmy Page might have written 20, and a good number of those can be found on Led Zeppelin’s second album from 1969. If you or someone close to you has ever been within 10 feet of a radio tuned to a classic rock station, you’ve heard them all, many times—maybe too many. For every young person who discovers 'Whole Lotta Love' and 'Heartbreaker' and 'Living Loving Maid (She’s Just a Woman)', there’s an older person who gets sick of them from overplay and doesn’t need to ever hear them again. Part of the challenge and excitement of revisiting a record upon reissue is trying to hear the music again with fresh ears, seeing if you can tap into that feeling of discovery that came from hearing it the first time. When I’m able to mentally put myself into this place— the kid who got his driver’s license a month ago, driving around listening to II on tape—the reissue sounds as thrilling as ever. \n \n Every track on this record is musically brilliant, and in the span of just a few months it’s amazing how much Page had enriched the band’s sound. Chiming acoustic guitars provide the contrast to the crunch in a whole new way on 'Ramble On' and 'Thank You', offering yet another template for mixing folk with proto-metal. 'Whole Lotta Love' might have gotten the band sued by Willie Dixon, but there was no sonic precedent for it in rock music—it’s a sound that would have been unimaginable without the rise of drug culture. If you are not a drummer, it’s hard to imagine listening to 'Moby Dick' very often, but better evidence of John Bonham’s genius is found elsewhere on the record. Zep’s rhythmic underpinning, especially the locked-in tandem of Jones and Bonham, was always their secret weapon, the thing that divided them from contemporaries like Black Sabbath. They could swing, they loved James Brown and Motown, and they took pride in the fact that people would dance at their shows. The bonus disc is a mildly interesting amalgam of alternate mixes and rough takes—the kind of stuff anyone but the most dedicated obsessives will listen to only once—and there’s little advance here lyrically from the debut, but II is still close to perfect. \n \n III is, indirectly, Led Zeppelin’s own version of Pink Floyd's Meddle—the folky, pretty early record that was never too popular and hence a favorite of indie types skeptical of such a massive mainstream band. That it opens with 'Immigrant Song', one of their top few rockers, only makes the later acoustic loveliness that much more affecting. The strings laid atop the acoustic guitar on 'Friends' foreshadow 'Kashmir'; 'Tangerine' has an amazing tension between the minor-key verses and the open, joyous chorus, as good an example of any of Zep as a pop band. The melancholy ache of 'That’s the Way' is Zep with their guard down—it goes down as easy as a great Cat Stevens song—and then by the end of the record things start to get a little weird, with the heavy acoustic hoedown of 'Bron-Y-Aur Stomp' and the acid-fried chug of the blues standard 'Shake ’em on Down', a nod to the hypnotic one-chord version by Mississippi Fred McDowell. III has easily the best bonus material too, including a fantastic unreleased version of the old blues song 'Keys to the Highway'. Depending on your age, you might remember III as 'the one with the Viking kittens song' or 'the one with that pretty song that played during an interlude of Almost Famous'; for someone who doesn’t necessarily want to be inundated with songs and riffs that became clichés, it might be the best place to start. \n \n For some, the interest in these sets is the remastering, an alleged improvement in sound, which makes sense for a band so song-oriented. I’ve always thought that Zeppelin, like Neil Young, were best heard from nice-sounding pressings from the ’70s that were utterly ubiquitous in used LP bins in the ’80s and ’90s. Back then, you could collect the entire Zeppelin catalog for something like $30, where the inferior sounding early CD masters would run you more like $150. \n \n These days the gap between different versions seems to be closing. I attended a listening session for these reissues in New York, hosted by Jimmy Page, and at one point he was asked which version sounded best, vinyl or CD. Page responded with saying the best version was the original analog tape, but 'unfortunately I can’t invite you all ’round to listen to it.' Suffice to say that these remasters sound very good, a bit louder but not overly so, but we’re likely reaching a point of diminishing returns. That said, I’m very glad these new remasters and the attendant publicity push exist, to get us all listening to and talking about Led Zeppelin again, where they stand and what they might mean. However you feel about them and their brand of ultra-huge arena rock, there has never been another band like them, before or since.",
    "image": "https://upload.wikimedia.org/wikipedia/en/e/ef/Led_Zeppelin_-_Led_Zeppelin_%281969%29_front_cover.png"
  }, {
    "artist": "Pink Floyd",
    "album": "The Dark Side of the Moon",
    "genre": "Rock",
    "image": "http://cps-static.rovicorp.com/3/JPG_500/MI0003/237/MI0003237416.jpg?partner=allrovi.com"
  }, {
    "artist": "Tame Impala",
    "album": "Currents",
    "genre": "Psych-pop",
    "image": "https://images-na.ssl-images-amazon.com/images/I/91sqAJFwmJL._SL1400_.jpg"
  }, {
    "artist": "Kendrick Lamar",
    "album": "untitled unmastered",
    "genre": "Hip to the hop",
    "image": "http://cdn4.pitchfork.com/albums/23037/1bcdfd6b.jpg"
  }, {
    "artist": "Funkadelic",
    "album": "Maggot Brain",
    "genre": "Funk",
    "image": "https://images.genius.com/cea522421a0e24d8dc84c8fe65da0e55.320x320x1.jpg"
  }, {
    "artist": "Rage Against the Machine",
    "album": "Rage Against the Machine",
    "genre": "Funk Metal",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/1a/RageAgainsttheMachineRageAgainsttheMachine.jpg"
  }]
}
